Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_20 (InputLayer)           [(None, 256, 256, 3) 0                                            
__________________________________________________________________________________________________
conv2d_771 (Conv2D)             (None, 256, 256, 16) 448         input_20[0][0]                   
__________________________________________________________________________________________________
batch_normalization_765 (BatchN (None, 256, 256, 16) 64          conv2d_771[0][0]                 
__________________________________________________________________________________________________
conv2d_772 (Conv2D)             (None, 256, 256, 16) 2320        batch_normalization_765[0][0]    
__________________________________________________________________________________________________
batch_normalization_766 (BatchN (None, 256, 256, 16) 64          conv2d_772[0][0]                 
__________________________________________________________________________________________________
max_pooling2d_42 (MaxPooling2D) (None, 128, 128, 16) 0           batch_normalization_766[0][0]    
__________________________________________________________________________________________________
conv2d_773 (Conv2D)             (None, 128, 128, 32) 544         max_pooling2d_42[0][0]           
__________________________________________________________________________________________________
batch_normalization_767 (BatchN (None, 128, 128, 32) 128         conv2d_773[0][0]                 
__________________________________________________________________________________________________
activation_705 (Activation)     (None, 128, 128, 32) 0           batch_normalization_767[0][0]    
__________________________________________________________________________________________________
conv2d_774 (Conv2D)             (None, 128, 128, 32) 9248        activation_705[0][0]             
__________________________________________________________________________________________________
conv2d_775 (Conv2D)             (None, 128, 128, 32) 544         max_pooling2d_42[0][0]           
__________________________________________________________________________________________________
batch_normalization_768 (BatchN (None, 128, 128, 32) 128         conv2d_774[0][0]                 
__________________________________________________________________________________________________
batch_normalization_769 (BatchN (None, 128, 128, 32) 128         conv2d_775[0][0]                 
__________________________________________________________________________________________________
add_48 (Add)                    (None, 128, 128, 32) 0           batch_normalization_768[0][0]    
                                                                 batch_normalization_769[0][0]    
__________________________________________________________________________________________________
activation_706 (Activation)     (None, 128, 128, 32) 0           add_48[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_43 (MaxPooling2D) (None, 64, 64, 32)   0           activation_706[0][0]             
__________________________________________________________________________________________________
conv2d_776 (Conv2D)             (None, 64, 64, 64)   2112        max_pooling2d_43[0][0]           
__________________________________________________________________________________________________
batch_normalization_770 (BatchN (None, 64, 64, 64)   256         conv2d_776[0][0]                 
__________________________________________________________________________________________________
activation_707 (Activation)     (None, 64, 64, 64)   0           batch_normalization_770[0][0]    
__________________________________________________________________________________________________
conv2d_777 (Conv2D)             (None, 64, 64, 64)   36928       activation_707[0][0]             
__________________________________________________________________________________________________
conv2d_778 (Conv2D)             (None, 64, 64, 64)   2112        max_pooling2d_43[0][0]           
__________________________________________________________________________________________________
batch_normalization_771 (BatchN (None, 64, 64, 64)   256         conv2d_777[0][0]                 
__________________________________________________________________________________________________
batch_normalization_772 (BatchN (None, 64, 64, 64)   256         conv2d_778[0][0]                 
__________________________________________________________________________________________________
add_49 (Add)                    (None, 64, 64, 64)   0           batch_normalization_771[0][0]    
                                                                 batch_normalization_772[0][0]    
__________________________________________________________________________________________________
activation_708 (Activation)     (None, 64, 64, 64)   0           add_49[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_44 (MaxPooling2D) (None, 32, 32, 64)   0           activation_708[0][0]             
__________________________________________________________________________________________________
conv2d_779 (Conv2D)             (None, 32, 32, 128)  8320        max_pooling2d_44[0][0]           
__________________________________________________________________________________________________
batch_normalization_773 (BatchN (None, 32, 32, 128)  512         conv2d_779[0][0]                 
__________________________________________________________________________________________________
activation_709 (Activation)     (None, 32, 32, 128)  0           batch_normalization_773[0][0]    
__________________________________________________________________________________________________
conv2d_780 (Conv2D)             (None, 32, 32, 128)  147584      activation_709[0][0]             
__________________________________________________________________________________________________
conv2d_781 (Conv2D)             (None, 32, 32, 128)  8320        max_pooling2d_44[0][0]           
__________________________________________________________________________________________________
batch_normalization_774 (BatchN (None, 32, 32, 128)  512         conv2d_780[0][0]                 
__________________________________________________________________________________________________
batch_normalization_775 (BatchN (None, 32, 32, 128)  512         conv2d_781[0][0]                 
__________________________________________________________________________________________________
add_50 (Add)                    (None, 32, 32, 128)  0           batch_normalization_774[0][0]    
                                                                 batch_normalization_775[0][0]    
__________________________________________________________________________________________________
activation_710 (Activation)     (None, 32, 32, 128)  0           add_50[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_45 (MaxPooling2D) (None, 16, 16, 128)  0           activation_710[0][0]             
__________________________________________________________________________________________________
conv2d_782 (Conv2D)             (None, 16, 16, 256)  33024       max_pooling2d_45[0][0]           
__________________________________________________________________________________________________
batch_normalization_776 (BatchN (None, 16, 16, 256)  1024        conv2d_782[0][0]                 
__________________________________________________________________________________________________
activation_711 (Activation)     (None, 16, 16, 256)  0           batch_normalization_776[0][0]    
__________________________________________________________________________________________________
conv2d_783 (Conv2D)             (None, 16, 16, 256)  590080      activation_711[0][0]             
__________________________________________________________________________________________________
conv2d_784 (Conv2D)             (None, 16, 16, 256)  33024       max_pooling2d_45[0][0]           
__________________________________________________________________________________________________
batch_normalization_777 (BatchN (None, 16, 16, 256)  1024        conv2d_783[0][0]                 
__________________________________________________________________________________________________
batch_normalization_778 (BatchN (None, 16, 16, 256)  1024        conv2d_784[0][0]                 
__________________________________________________________________________________________________
add_51 (Add)                    (None, 16, 16, 256)  0           batch_normalization_777[0][0]    
                                                                 batch_normalization_778[0][0]    
__________________________________________________________________________________________________
activation_712 (Activation)     (None, 16, 16, 256)  0           add_51[0][0]                     
__________________________________________________________________________________________________
up_sampling2d_24 (UpSampling2D) (None, 32, 32, 256)  0           activation_712[0][0]             
__________________________________________________________________________________________________
concatenate_24 (Concatenate)    (None, 32, 32, 384)  0           up_sampling2d_24[0][0]           
                                                                 activation_710[0][0]             
__________________________________________________________________________________________________
conv2d_785 (Conv2D)             (None, 32, 32, 128)  49280       concatenate_24[0][0]             
__________________________________________________________________________________________________
batch_normalization_779 (BatchN (None, 32, 32, 128)  512         conv2d_785[0][0]                 
__________________________________________________________________________________________________
activation_713 (Activation)     (None, 32, 32, 128)  0           batch_normalization_779[0][0]    
__________________________________________________________________________________________________
conv2d_786 (Conv2D)             (None, 32, 32, 128)  147584      activation_713[0][0]             
__________________________________________________________________________________________________
conv2d_787 (Conv2D)             (None, 32, 32, 128)  49280       concatenate_24[0][0]             
__________________________________________________________________________________________________
batch_normalization_780 (BatchN (None, 32, 32, 128)  512         conv2d_786[0][0]                 
__________________________________________________________________________________________________
batch_normalization_781 (BatchN (None, 32, 32, 128)  512         conv2d_787[0][0]                 
__________________________________________________________________________________________________
add_52 (Add)                    (None, 32, 32, 128)  0           batch_normalization_780[0][0]    
                                                                 batch_normalization_781[0][0]    
__________________________________________________________________________________________________
activation_714 (Activation)     (None, 32, 32, 128)  0           add_52[0][0]                     
__________________________________________________________________________________________________
up_sampling2d_25 (UpSampling2D) (None, 64, 64, 128)  0           activation_714[0][0]             
__________________________________________________________________________________________________
concatenate_25 (Concatenate)    (None, 64, 64, 192)  0           up_sampling2d_25[0][0]           
                                                                 activation_708[0][0]             
__________________________________________________________________________________________________
conv2d_788 (Conv2D)             (None, 64, 64, 64)   12352       concatenate_25[0][0]             
__________________________________________________________________________________________________
batch_normalization_782 (BatchN (None, 64, 64, 64)   256         conv2d_788[0][0]                 
__________________________________________________________________________________________________
activation_715 (Activation)     (None, 64, 64, 64)   0           batch_normalization_782[0][0]    
__________________________________________________________________________________________________
conv2d_789 (Conv2D)             (None, 64, 64, 64)   36928       activation_715[0][0]             
__________________________________________________________________________________________________
conv2d_790 (Conv2D)             (None, 64, 64, 64)   12352       concatenate_25[0][0]             
__________________________________________________________________________________________________
batch_normalization_783 (BatchN (None, 64, 64, 64)   256         conv2d_789[0][0]                 
__________________________________________________________________________________________________
batch_normalization_784 (BatchN (None, 64, 64, 64)   256         conv2d_790[0][0]                 
__________________________________________________________________________________________________
add_53 (Add)                    (None, 64, 64, 64)   0           batch_normalization_783[0][0]    
                                                                 batch_normalization_784[0][0]    
__________________________________________________________________________________________________
activation_716 (Activation)     (None, 64, 64, 64)   0           add_53[0][0]                     
__________________________________________________________________________________________________
up_sampling2d_26 (UpSampling2D) (None, 128, 128, 64) 0           activation_716[0][0]             
__________________________________________________________________________________________________
concatenate_26 (Concatenate)    (None, 128, 128, 96) 0           up_sampling2d_26[0][0]           
                                                                 activation_706[0][0]             
__________________________________________________________________________________________________
conv2d_791 (Conv2D)             (None, 128, 128, 32) 3104        concatenate_26[0][0]             
__________________________________________________________________________________________________
batch_normalization_785 (BatchN (None, 128, 128, 32) 128         conv2d_791[0][0]                 
__________________________________________________________________________________________________
activation_717 (Activation)     (None, 128, 128, 32) 0           batch_normalization_785[0][0]    
__________________________________________________________________________________________________
conv2d_792 (Conv2D)             (None, 128, 128, 32) 9248        activation_717[0][0]             
__________________________________________________________________________________________________
conv2d_793 (Conv2D)             (None, 128, 128, 32) 3104        concatenate_26[0][0]             
__________________________________________________________________________________________________
batch_normalization_786 (BatchN (None, 128, 128, 32) 128         conv2d_792[0][0]                 
__________________________________________________________________________________________________
batch_normalization_787 (BatchN (None, 128, 128, 32) 128         conv2d_793[0][0]                 
__________________________________________________________________________________________________
add_54 (Add)                    (None, 128, 128, 32) 0           batch_normalization_786[0][0]    
                                                                 batch_normalization_787[0][0]    
__________________________________________________________________________________________________
activation_718 (Activation)     (None, 128, 128, 32) 0           add_54[0][0]                     
__________________________________________________________________________________________________
up_sampling2d_27 (UpSampling2D) (None, 256, 256, 32) 0           activation_718[0][0]             
__________________________________________________________________________________________________
concatenate_27 (Concatenate)    (None, 256, 256, 48) 0           up_sampling2d_27[0][0]           
                                                                 batch_normalization_766[0][0]    
__________________________________________________________________________________________________
conv2d_794 (Conv2D)             (None, 256, 256, 16) 784         concatenate_27[0][0]             
__________________________________________________________________________________________________
batch_normalization_788 (BatchN (None, 256, 256, 16) 64          conv2d_794[0][0]                 
__________________________________________________________________________________________________
activation_719 (Activation)     (None, 256, 256, 16) 0           batch_normalization_788[0][0]    
__________________________________________________________________________________________________
conv2d_795 (Conv2D)             (None, 256, 256, 16) 2320        activation_719[0][0]             
__________________________________________________________________________________________________
conv2d_796 (Conv2D)             (None, 256, 256, 16) 784         concatenate_27[0][0]             
__________________________________________________________________________________________________
batch_normalization_789 (BatchN (None, 256, 256, 16) 64          conv2d_795[0][0]                 
__________________________________________________________________________________________________
batch_normalization_790 (BatchN (None, 256, 256, 16) 64          conv2d_796[0][0]                 
__________________________________________________________________________________________________
add_55 (Add)                    (None, 256, 256, 16) 0           batch_normalization_789[0][0]    
                                                                 batch_normalization_790[0][0]    
__________________________________________________________________________________________________
activation_720 (Activation)     (None, 256, 256, 16) 0           add_55[0][0]                     
__________________________________________________________________________________________________
conv2d_797 (Conv2D)             (None, 256, 256, 1)  17          activation_720[0][0]             
==================================================================================================
Total params: 1,210,513
Trainable params: 1,206,129
Non-trainable params: 4,384
__________________________________________________________________________________________________